Ran Plan for 3 projects:

1. dir: `bruno-athaide-product-test/caio-config` workspace: `default`
1. dir: `bruno-athaide-product-test/main-config` workspace: `default`
1. dir: `bruno-athaide-product-test/shared` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/caio-config` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_organizations.my_organizations: Reading...
data.configcat_organizations.my_organizations: Read complete after 1s [id=1755806024]
data.configcat_products.my_products: Read complete after 2s [id=1755806025]
data.configcat_configs.my_configs: Reading...
data.configcat_environments.my_environments: Reading...
data.configcat_configs.my_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755806026]
data.configcat_environments.my_environments: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755806026]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.is_awesome will be created
+ resource "configcat_setting" "is_awesome" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "this is the hint for my awesome feature flag"
      + id           = (known after apply)
      + key          = "isMyAwesomeFeatureEnabled"
      + name         = "My awesome feature flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting_value.setting_value will be created
+ resource "configcat_setting_value" "setting_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "false"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/caio-config
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fcaio-config%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/caio-config
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/main-config` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/Users/caio.queiroz/.atlantis/bin/terraform1.13.0 plan -input=false -refresh -out "/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/1/default/bruno-athaide-product-test/main-config/default.tfplan"' in '/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/1/default/bruno-athaide-product-test/main-config': exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "configcat_basic_auth_username" {
│ 
│ The root module input variable "configcat_basic_auth_username" is not set,
│ and has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 6:
│    6: variable "configcat_basic_auth_password" {
│ 
│ The root module input variable "configcat_basic_auth_password" is not set,
│ and has no default value. Use a -var or -var-file command line argument to
│ provide a value for this variable.
╵

```
</details>

---
### 3. dir: `bruno-athaide-product-test/shared` workspace: `default`
```diff
Changes to Outputs:
+ configcat_product_name = "Bruno Athaide Product Test"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/shared
  ```

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```